# ViewBoundariesTooLarge Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ImportExportFailures..::..ViewBoundariesTooLarge Property
BuiltInFailures..::..ImportExportFailures Class See Also
---
The view boundaries are too large to export the view..
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ViewBoundariesTooLarge { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ViewBoundariesTooLarge As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ViewBoundariesTooLarge {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..ImportExportFailures Class
Autodesk.Revit.DB Namespace